Repository: trajis-tech/local-subtitle-translator
Catalog: po/*.po
Languages: es_es

source: Local Subtitle Translator (Vision + Reason)
es_es: Traductor local de subtítulos (visión + comprensión)

source: # 🎬 Local Subtitle Translator (EN → target language) No Ollama needed. Runs with llama-cpp-python (GGUF) + optional local vision via Moondream2.
es_es: # 🎬 Traductor local de subtítulos (inglés → idioma objetivo) No necesitas instalar Ollama. Utiliza llama-cpp-python (GGUF) en local y, opcionalmente, el modelo de visión local Moondream2.

source: No Ollama needed. Runs with llama-cpp-python (GGUF) + optional local vision (GGUF vision model).
es_es: No necesitas Ollama. Utiliza llama-cpp-python (GGUF) en local y, opcionalmente, un modelo de visión GGUF local.

source: Video (MKV/MP4) — required for audio and vision analysis
es_es: Vídeo (MKV/MP4) — necesario para análisis de audio y visión

source: SRT (English)
es_es: SRT (inglés)

source: SRT encoding
es_es: Codificación del SRT

source: Enable vision fallback (Moondream2)
es_es: Activar respaldo por visión (Moondream2)

source: Enable vision fallback (Run C/D, local GGUF vision model)
es_es: Activar respaldo por visión (Run C/D, modelo de visión GGUF local)

source: Max frames per subtitle (Run D)
es_es: Máximo de fotogramas por línea (Run D multicuadro)

source: Frame offsets within subtitle span (comma-separated, 0..1)
es_es: Desplazamientos de fotograma dentro del intervalo del subtítulo (0..1, separados por comas)

source: e.g. 0.3,0.7
es_es: ej.: 0.3,0.7

source: 🚀 Translate
es_es: 🚀 Traducir

source: Reset
es_es: Restablecer

source: Idle. Ready for new translation.
es_es: Inactivo. Listo para nueva traducción.

source: Download translated SRT
es_es: Descargar SRT traducido

source: Status (EN)
es_es: Estado (EN)

source: Latest log
es_es: Última línea del registro

source: Preview frame (when vision runs)
es_es: Fotograma de vista previa (cuando se usa visión)

source: Log (last 200 lines)
es_es: Registro (últimas 200 líneas)

source: Translate
es_es: Traducir

source: Glossary
es_es: Glosario

source: Setup / Model Paths
es_es: Configuración / Rutas de modelos

source: ### Glossary / Replace Library - Edit in-table - Import CSV (2 columns: English, {target_lang}) - Import Subtitle Edit `.template` (best-effort XML extraction)
es_es: ### Glosario / Biblioteca de reemplazos - Editar directamente en la tabla - Importar CSV (2 columnas: English, {target_lang}) - Importar `.template` de Subtitle Edit (extracción mejor-esfuerzo desde XML)

source: English
es_es: Inglés

source: Traditional Chinese
es_es: Chino tradicional

source: Note
es_es: Nota

source: Enabled
es_es: Activado

source: Load
es_es: Cargar

source: Save
es_es: Guardar

source: Import CSV
es_es: Importar CSV

source: Import Subtitle Edit .template
es_es: Importar Subtitle Edit .template

source: Glossary status
es_es: Estado del glosario

source: ### config.json Edit `config.json` to point to your GGUF model files under `./models/`. If missing, the Translate tab will show a clear error.
es_es: ### config.json Edita `config.json` para que apunte a tus archivos de modelo GGUF dentro de `./models/`. Si falta la configuración, la pestaña de traducción mostrará un error claro.

source: Write to config.json
es_es: Escribir en config.json

source: Run mode
es_es: Modo de ejecución

source: all = A→E; A = Audio; B = Brief v1; C = single-frame vision → brief v2; D = multi-frame vision → brief v3; E = Translate
es_es: all = A→E; A = Audio; B = Brief v1; C = visión 1 fotograma → brief v2; D = visión multicuadro → brief v3; E = Traducir

source: Run E scheme (when to use main vs. localization model)
es_es: Esquema Run E (cuándo usar: modelo principal / modelo local fuerte o débil)

source: Full=both strong | MAIN-led=main strong | LOCAL-led=local strong | Draft-first=both weak. See README Run E.
es_es: Full=ambos fuertes | MAIN-led=principal fuerte, local débil | LOCAL-led=local fuerte, principal débil | Draft-first=ambos débiles. Ver README esquema Run E.

source: all = A→B→(C/D)→E→F; E = context expansion; F = Translate
es_es: all = A→B→(C/D)→E→F; E = expansión de contexto; F = Traducir

source: Run F scheme (when to use main vs. localization model)
es_es: Esquema Run F (cuándo usar: modelo principal / modelo local fuerte o débil)

source: Full=both strong | MAIN-led=main strong | LOCAL-led=local strong | Draft-first=both weak. See README Run F.
es_es: Full=ambos fuertes | MAIN-led=principal fuerte, local débil | LOCAL-led=local fuerte, principal débil | Draft-first=ambos débiles. Ver README esquema Run F.

source: Enable context expansion fallback (Run E, need_more_context)
es_es: Habilitar fallback de expansión de contexto (Run E, need_more_context)

source: Full (both strong)
es_es: Full (principal fuerte + local fuerte)

source: MAIN-led (main strong, local weak)
es_es: MAIN-led (principal fuerte, local débil)

source: LOCAL-led (local strong, main weak)
es_es: LOCAL-led (local fuerte, principal débil)

source: Draft-first (both weak)
es_es: Draft-first (ambos débiles)

source: Target language (locale code)
es_es: Idioma objetivo (código de localización)

source: Target language
es_es: Idioma objetivo

source: configured in language_config.json
es_es: configurado en language_config.json

source: Idle.
es_es: Inactivo.

source: Please upload an SRT file.
es_es: Por favor, sube un archivo SRT.

source: Missing model files. Please follow the README to download GGUF models into ./models
es_es: Faltan archivos de modelo. Por favor, sigue el README para descargar modelos GGUF en ./models

source: Missing models.
es_es: Faltan modelos.

source: SRT has 0 lines.
es_es: El archivo SRT tiene 0 líneas.

source: Parsing subtitles... ({total} lines)
es_es: Analizando subtítulos... ({total} líneas)

source: Run A: Audio analysis...
es_es: Ejecución A: Analizando audio...

source: Run A: Audio analysis
es_es: Ejecución A: Análisis de audio

source: Run A: Loaded existing results ({count} items)
es_es: Ejecución A: Resultados existentes cargados ({count} elementos)

source: Run A: Starting audio analysis...
es_es: Ejecución A: Iniciando análisis de audio...

source: Run A: Processing... (check log for detailed progress)
es_es: Ejecución A: Procesando... (consulta el registro para ver el progreso detallado)

source: Run A: Completed ({count} items)
es_es: Ejecución A: Completada ({count} elementos)

source: Run A: Error occurred, re-analyzing...
es_es: Ejecución A: Ocurrió un error, reanalizando...

source: Run A: Completed
es_es: Ejecución A: Completada

source: Run B: Loading main reasoning model (Stage 2)...
es_es: Ejecución B: Cargando modelo de razonamiento principal (Etapa 2)...

source: Run B: Loading main reasoning model (Stage 2)
es_es: Ejecución B: Cargando modelo de razonamiento principal (Etapa 2)

source: Run B: Loading model / processing... (see log)
es_es: Ejecución B: Cargando modelo / procesando... (consulta el registro)

source: Run B: Model loaded, processing with parallel batch inference...
es_es: Ejecución B: Modelo cargado, procesando con inferencia por lotes paralela...

source: Run B: Reloading main reasoning model (Stage 2)...
es_es: Ejecución B: Recargando modelo de razonamiento principal (Etapa 2)...

source: Run B: Reloading / processing... (see log)
es_es: Ejecución B: Recargando / procesando... (consulta el registro)

source: Run B: Model reloaded, processing with parallel batch inference...
es_es: Ejecución B: Modelo recargado, procesando con inferencia por lotes paralela...

source: Run B: Completed
es_es: Ejecución B: Completada

source: Run B: Completed ({count} items)
es_es: Ejecución B: Completada ({count} elementos)

source: Run C: Loading vision model (1-frame) for {count} items...
es_es: Ejecución C: Cargando modelo de visión (1 fotograma) para {count} elementos...

source: Run C: Loading vision model (1-frame)
es_es: Ejecución C: Cargando modelo de visión (1 fotograma)

source: Run C: Loading vision model (1-frame)...
es_es: Ejecución C: Cargando modelo de visión (1 fotograma)...

source: Run C: Vision model loaded, analyzing frames...
es_es: Ejecución C: Modelo de visión cargado, analizando fotogramas...

source: Run C: Reloading vision model (1-frame)...
es_es: Ejecución C: Recargando modelo de visión (1 fotograma)...

source: Run C: Vision model reloaded, analyzing frames...
es_es: Ejecución C: Modelo de visión recargado, analizando fotogramas...

source: Run C: Regenerating brief v2 with vision...
es_es: Ejecución C: Regenerando resumen v2 con visión...

source: Run C: Reloading main reasoning model for brief v2...
es_es: Ejecución C: Recargando modelo de razonamiento principal para resumen v2...

source: Run C: Loading model / brief v2... (see log)
es_es: Ejecución C: Cargando modelo / resumen v2... (consulta el registro)

source: Run C: Main model reloaded, regenerating brief v2 with parallel batch inference...
es_es: Ejecución C: Modelo principal recargado, regenerando resumen v2 con inferencia por lotes paralela...

source: Run C: Reloading / brief v2... (see log)
es_es: Ejecución C: Recargando / resumen v2... (consulta el registro)

source: Run C: Completed
es_es: Ejecución C: Completada

source: Run C: Completed ({count} items)
es_es: Ejecución C: Completada ({count} elementos)

source: Run D: Loading vision model (multi-frame) for {count} items...
es_es: Ejecución D: Cargando modelo de visión (múltiples fotogramas) para {count} elementos...

source: Run D: Loading vision model (multi-frame)
es_es: Ejecución D: Cargando modelo de visión (múltiples fotogramas)

source: Run D: Loading vision model (multi-frame)...
es_es: Ejecución D: Cargando modelo de visión (múltiples fotogramas)...

source: Run D: Vision model loaded, analyzing multiple frames...
es_es: Ejecución D: Modelo de visión cargado, analizando múltiples fotogramas...

source: Run D: Reloading vision model (multi-frame)...
es_es: Ejecución D: Recargando modelo de visión (múltiples fotogramas)...

source: Run D: Vision model reloaded, analyzing multiple frames...
es_es: Ejecución D: Modelo de visión recargado, analizando múltiples fotogramas...

source: Run D: Regenerating brief v3 with multi-frame vision...
es_es: Ejecución D: Regenerando resumen v3 con visión de múltiples fotogramas...

source: Run D: Reloading main reasoning model for brief v3...
es_es: Ejecución D: Recargando modelo de razonamiento principal para resumen v3...

source: Run D: Loading model / brief v3... (see log)
es_es: Ejecución D: Cargando modelo / resumen v3... (consulta el registro)

source: Run D: Main model reloaded, regenerating brief v3 with parallel batch inference...
es_es: Ejecución D: Modelo principal recargado, regenerando resumen v3 con inferencia por lotes paralela...

source: Run D: Reloading / brief v3... (see log)
es_es: Ejecución D: Recargando / resumen v3... (consulta el registro)

source: Run D: Completed
es_es: Ejecución D: Completada

source: Run D: Completed ({count} items)
es_es: Ejecución D: Completada ({count} elementos)

source: Run E: Context expansion...
es_es: Ejecución E: Expansión de contexto...

source: Run E: Context expansion
es_es: Ejecución E: Expansión de contexto

source: Run E: Completed
es_es: Ejecución E: Completada

source: Run F: Loading translation model (localization)...
es_es: Ejecución F: Cargando modelo de traducción (localización)...

source: Run F: Loading translation model (localization)
es_es: Ejecución F: Cargando modelo de traducción (localización)

source: Run F: Loading translation model / processing... (see log)
es_es: Ejecución F: Cargando modelo / procesando... (ver log)

source: Run F: Translation model loaded, processing with parallel batch inference...
es_es: Ejecución F: Modelo cargado, procesando con inferencia por lotes en paralelo...

source: Run F: Reloading translation model (localization)...
es_es: Ejecución F: Recargando modelo de traducción (localización)...

source: Run F: Reloading / processing... (see log)
es_es: Ejecución F: Recargando / procesando... (ver log)

source: Run F: Translation model reloaded, processing with parallel batch inference...
es_es: Ejecución F: Modelo recargado, procesando con inferencia por lotes en paralelo...

source: Run F: Completed
es_es: Ejecución F: Completada

source: Translation not executed (Run F not selected).
es_es: Traducción no ejecutada (ejecución F no seleccionada).

source: Run E: Loading translation model (localization)...
es_es: Ejecución E: Cargando modelo de traducción (localización)...

source: Run E: Loading translation model (localization)
es_es: Ejecución E: Cargando modelo de traducción (localización)

source: Run E: Loading translation model / processing... (see log)
es_es: Ejecución E: Cargando modelo de traducción / procesando... (consulta el registro)

source: Run E: Translation model loaded, processing with parallel batch inference...
es_es: Ejecución E: Modelo de traducción cargado, procesando con inferencia por lotes paralela...

source: Run E: Reloading translation model (localization)...
es_es: Ejecución E: Recargando modelo de traducción (localización)...

source: Run E: Reloading / processing... (see log)
es_es: Ejecución E: Recargando / procesando... (consulta el registro)

source: Run E: Translation model reloaded, processing with parallel batch inference...
es_es: Ejecución E: Modelo de traducción recargado, procesando con inferencia por lotes paralela...

source: All runs completed!
es_es: ¡Todas las ejecuciones completadas!

source: Translation not executed (Run E not selected).
es_es: Traducción no ejecutada (Ejecución E no seleccionada).

source: Loaded {count} entries from {path}
es_es: Cargadas {count} entradas desde {path}

source: Saved {count} entries to {path}
es_es: Guardadas {count} entradas en {path}

source: Imported {new_count} from CSV. Total {total_count}.
es_es: Importadas {new_count} desde CSV. Total {total_count}.

source: Imported {new_count} from .template (best-effort). Total {total_count}.
es_es: Importadas {new_count} desde .template (mejor esfuerzo). Total {total_count}.

source: Saved config.json
es_es: config.json guardado

source: Failed: {error}
es_es: Falló: {error}
